# Assignment 1
## Mike Johnson
### January 20, 2025

****

In [1]:
#%pip install jupysql duckdb-engine --quiet

In [2]:
# Load sql extension
%load_ext sql

In [3]:
# Connect to housing.db
%sql sqlite:///housing.db

Connecting to 'sqlite:///housing.db'

#### 1. Return the first 7 records from the housing table

In [4]:
%%sql

SELECT *
FROM housing
LIMIT 7;

Running query in 'sqlite:///housing.db'

+-------+---------+------+-------+-------+----------+--------+----------+-----------+
| entry |   city  | year | month | sales |  volume  | median | listings | inventory |
+-------+---------+------+-------+-------+----------+--------+----------+-----------+
|   1   | Abilene | 2000 |   1   |   72  | 5380000  | 71400  |   701    |    6.3    |
|   2   | Abilene | 2000 |   2   |   98  | 6505000  | 58700  |   746    |    6.6    |
|   3   | Abilene | 2000 |   3   |  130  | 9285000  | 58100  |   784    |    6.8    |
|   4   | Abilene | 2000 |   4   |   98  | 9730000  | 68600  |   785    |    6.9    |
|   5   | Abilene | 2000 |   5   |  141  | 10590000 | 67300  |   794    |    6.8    |
|   6   | Abilene | 2000 |   6   |  156  | 13910000 | 66900  |   780    |    6.6    |
|   7   | Abilene | 2000 |   7   |  152  | 12635000 | 73500  |   742    |    6.2    |
+-------+---------+------+-------+-------+----------+--------+----------+-----------+

****

#### 2. How many records in the data had sales greater than 100 and a median sales price greater than 100000? Write a query to return the result.

In [10]:
%%sql

SELECT COUNT(*) AS 'Count'
FROM housing
WHERE
    sales > 100
    AND median > 100000;

Running query in 'sqlite:///housing.db'

+-------+
| Count |
+-------+
|  5106 |
+-------+

****

#### 3. Show the number of records in the data that had sales greater than 100 or a median sales price less than 100000 by month. The result should contain two columns: month and num_records.

In [16]:
# Adjust display limit to display all 12 months
%config SqlMagic.displaylimit = 12

In [17]:
%%sql

SELECT
    month,
    COUNT(*) as num_records
FROM housing
WHERE
    sales > 100
    OR median < 100000
GROUP BY month

Running query in 'sqlite:///housing.db'

+-------+-------------+
| month | num_records |
+-------+-------------+
|   1   |     576     |
|   2   |     582     |
|   3   |     625     |
|   4   |     620     |
|   5   |     639     |
|   6   |     625     |
|   7   |     626     |
|   8   |     586     |
|   9   |     563     |
|   10  |     575     |
|   11  |     546     |
|   12  |     559     |
+-------+-------------+
Truncated to displaylimit of 12.

****